{
    "title":{
        "0":"The Dark Knight"
    },
    "release_date":{
        "0":"2008"
    },
    "main_genres":{
        "0":[
            "Action"
        ]
    },
    "sub_genres":{
        "0":[
            "Action Epic",
            "Epic",
            "Superhero",
            "Crime",
            "Drama",
            "Thriller"
        ]
    },
    "directors":{
        "0":[
            "Christopher Nolan"
        ]
    },
    "stars":{
        "0":[
            "Christian Bale",
            "Heath Ledger",
            "Aaron Eckhart"
        ]
    },
    "rating":{
        "0":9.0
    },
    "duration":{
        "0":"2h 32m"
    },
    "description":{
        "0":"When a menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman, James Gordon and Harvey Dent must work together to put an end to the madness."
    },
    "storyline":{
        "0":"Gotham's new District Attorney has been elected. His name is Harvey Dent, and he has a radical new agenda that threatens to take down Gotham's organized crime underworld once and for all with an iron fist. But the emergence of the rogue vigilante known as Batman has caused problems for Dent and his agenda. A new criminal mastermind known only as \"The Joker\" has arrived and aims to take Gotham out from under Harvey Dent's iron fist. The Joker stages a masterfully planned bank robbery and robs the Gotham mob blind. He uses this money to stage a series of horrific and strategic attacks against the city and its people, each one carefully planned and aimed at Dent and Batman, while causing the rest of the city to enter panic mode. Meanwhile, Batman thinks he might have found a lead to The Joker thanks to Wayne Enterprises' dealings with a shady Chinese banker, and that takes Batman and Alfred to Hong Kong. The Joker has no rules, but Batman has only one, and the Joker aims to make Batman break his only rule. But who will be the one to take him out, will it be rogue vigilante Batman, or will it be elected official Harvey Dent, the new hero with a face?"
    },
    "keywords":{
        "0":[
            "psychopath",
            "superhero",
            "moral dilemma",
            "clown",
            "criminal mastermind"
        ]
    }
}